13/data/attachments/e41014c21e5f0fb7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c482c75b-b9de-471f-83dd-c24497df9ffd</nif:username>
            <nif:friendToBeAdded>Ruben_finally_Friend_40927_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>